#### TextAlignFlags Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all the Text align flags.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TextAlignFlags ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextAlignFlags ``` |

| Visual C++ |
| --- |
| ``` public enum class TextAlignFlags ``` |

# Members

| Member name | Description |
| --- | --- |
| TEF\_ALIGN\_LEFT | Align text left |
| TEF\_ALIGN\_CENTER | Align text center |
| TEF\_ALIGN\_RIGHT | Align text right |
| TEF\_ALIGN\_TOP | Align text top |
| TEF\_ALIGN\_MIDDLE | Align text middle |
| TEF\_ALIGN\_BOTTOM | Align text bottom |

# See Also

Autodesk.Revit.DB Namespace